; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 6471)
	(= (fuel plane1) 349)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city1)
	(= (capacity plane2) 7767)
	(= (fuel plane2) 2295)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 10)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 9)
	(at person1 city0)
	(at person2 city3)
	(at person3 city2)
	(at person4 city1)
	(at person5 city2)
	(at person6 city2)
	(at person7 city0)
	(at person8 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 923)
	(= (distance city0 city2) 732)
	(= (distance city0 city3) 800)
	(= (distance city1 city0) 923)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 856)
	(= (distance city1 city3) 748)
	(= (distance city2 city0) 732)
	(= (distance city2 city1) 856)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 597)
	(= (distance city3 city0) 800)
	(= (distance city3 city1) 748)
	(= (distance city3 city2) 597)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at person1 city1)
	(at person2 city3)
	(at person3 city1)
	(at person4 city2)
	(at person5 city2)
	(at person6 city3)
	(at person7 city3)
	(at person8 city1)
	))

(:metric minimize (+ (* 5 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane1 city2)
   changed: (fuel plane1) from 349 to 6471
   goals met: 2 of 9
2. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 1791, (fuel plane1) from 6471 to 4680
   goals met: 2 of 9
3. (board person8 plane1 city3)
   deleted: (at person8 city3)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 9
4. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 1791 to 3582, (fuel plane1) from 4680 to 2889
   goals met: 2 of 9
5. (board person3 plane1 city2)
   deleted: (at person3 city2)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 9
6. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 2 of 9
7. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 3582 to 5778, (fuel plane1) from 2889 to 693
   goals met: 3 of 9
8. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 3 of 9
9. (refuel plane1 city0)
   changed: (fuel plane1) from 693 to 6471
   goals met: 3 of 9
10. (board person7 plane1 city0)
   deleted: (at person7 city0)
   added: (in person7 plane1)
   changed: (onboard plane1) from 4 to 5
   goals met: 3 of 9
11. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 5778 to 8547, (fuel plane1) from 6471 to 3702
   goals met: 2 of 9
12. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   changed: (onboard plane1) from 5 to 4
   goals met: 3 of 9
13. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   changed: (onboard plane1) from 4 to 3
   goals met: 4 of 9
14. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   changed: (onboard plane1) from 3 to 2
   goals met: 5 of 9
15. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 5 of 9
16. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 8547 to 11316, (fuel plane1) from 3702 to 933
   goals met: 6 of 9
17. (refuel plane1 city0)
   changed: (fuel plane1) from 933 to 6471
   goals met: 6 of 9
18. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 11316 to 13512, (fuel plane1) from 6471 to 4275
   goals met: 5 of 9
19. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 9
20. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 13512 to 15303, (fuel plane1) from 4275 to 2484
   goals met: 6 of 9
21. (debark person6 plane1 city3)
   deleted: (in person6 plane1)
   added: (at person6 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 9
22. (debark person7 plane1 city3)
   deleted: (in person7 plane1)
   added: (at person7 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 9
23. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 15303 to 17703, (fuel plane1) from 2484 to 84
   goals met: 9 of 9
